# FaceArray Properties

---
The FaceArray type exposes the following members.
| Name| Description
---|---|---
| IsEmpty| Test to see if the array is empty.
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
| Item| Gets or sets a face at a specified index within the array.
| Size| Returns the number of faces that are in the array.
Top
#### Reference
FaceArray Class
Autodesk.Revit.DB Namespace